{"_id":{"$oid":"588263c7046fade55a0d46e0"},"nav":{"styling":"styles","components":[{"name":"about"},{"name":"contact"},{"name":"other"}]},"Resume":{"TechnicalSkills":[{"value":"HTML"},{"value":"HTML5"},{"value":"CSS"},{"value":"CSS3"},{"value":"JavaScript"},{"value":"JSON"},{"value":"Sass"},{"value":"Bourbon"},{"value":"Node.js"},{"value":"Express.js"},{"value":"jQuery"},{"value":"Angular"},{"value":"Angular-Route"},{"value":"Angular-Material"},{"value":"React"},{"value":"Ipware"},{"value":"Socket.io"},{"value":"Underscore.js"},{"value":"nodemailer"},{"value":"bootstrap"},{"value":"Passport"},{"value":"bcrypt"},{"value":"Bower"},{"value":"Nodemon"},{"value":"Git"},{"value":"MongoDB"},{"value":"SQL"},{"value":"MySQL"},{"value":"PostgreSQL"},{"value":"Babel"},{"value":"Grunt"},{"value":"Gulp"},{"value":"Webpack"},{"value":"Java"},{"value":"Python"},{"value":"Heroku"},{"value":"Github"},{"value":"BitBucket"},{"value":"Octave"},{"value":"R"},{"value":"Latex"},{"value":"Beamer"},{"value":"Labview"},{"value":"Mathematica"},{"value":"TinkerCAD"},{"value":"Catalyst"},{"value":"IDL"}],"Experience":[{"Company":"Freelance Software Developer","Title":"Full Stack Developer","Dates":"Apr,2016-Current","About":[{"Header":"Image Processing Software","Body":"A private image and design company is interested in linking the images to related content. Commonly sites link an image to images of the same artist or line, and many companies use the Amazon style, “other customers viewed” style. However this project aims to create a more advanced processing software that works with an image qualities and characteristics such as contrast, distortion, palette range, etc."},{"Header":"Makeup Artist Personal Site","Body":"A local makeup artist is trying to develop a brand not only as a local wedding and special occasion artist but rather convert to an overall makeup stylist, internet and social media personality, and productguru. I am helping her in creating a site that she can be proud of and really links to her image as an artist."}]},{"Company":"Prime Digital Academy","Title":"Full Stack Developement and Software Education","Dates":"Dec,2015-Apr,2016","About":[{"Header":"DataFit","Body":"Gym Apps currently do not allow for flexible inputs, they have a preset variables. This application allows for multiple variables and sub variables for a given exercise. . It allows one to create to particular exercises and track them over time. Technology Used: SEAN Stack HTML5, CSS3, JavaScript, AngularJS, Underscore.js, PostgreSQL, Sass, Express.js, Node.js."},{"Header":"Duplex Chick, Kari Lundin","Body":"Kari Lundin is the self proclaimed “Duplex Chick” who came to us to create an application that would allow her potential clients to easily see the benefits of owning a duplex. There are many websites that compare renting vs. buying a home, however none that compare renting a house vs buying a house vs buying a duplex and renting out half of it. Our solution was to create an interactive website that allowed the user to actively decide on any and all variables in buying a home and having multiple graphs actively display the potential cost and benefits of a duplex. Technologies Used: MEAN stack (mongoDB, Express.js, Angular.js, Node.js), passport, Angular Material"}]},{"Company":"Augsburg College Physics Department","Title":"Researcher","Dates":"May-Aug 2013, May-Aug 2014","About":[{"Header":"Jack of all trades","Body":"Researched the fractal dimension, width distribution and hygroscopicity of entangled glass-phase saccharide amorphous microfilaments through the use of scanning electron microscopy, time lapse photography, fourth order analytical scales, MATLAB and ImageJ. LabView, Arduino coding and wiring, and 3d printing were used in the creation of working Langmuir troughs allowing other researchers to effectively study lipid monolayers. Supervised and ran the Augsburg College 3d printer, allowing for other students and faculty to prototype equipment and visualize complex mathematical patterns."}]},{"Company":"Augay Farms","Title":"Dairy Farmer","Dates":"Apr-Aug 2009","About":[{"Header":"Milker, Herder, shoveler","Body":"Herding, cleaning and milking the beautiful and gentle bovine creatures"}]},{"Company":"Wild Apple Graphics","Title":"Warehouse Associate","Dates":"Apr-Aug 2007, Apr-Aug 2008","About":[{"Header":"Find Guy","Body":"Prepared, located, and organized products to ensure the proper packing and shipping to clients."}]}],"Education":[{"School":"Augsburg College","City":"Minneapolis","State":"MN","GradDate":"May 2015","About":{"header":"B.S. Mathematics and Physics","Body":[{"value":"Inducted into Pi Mu Epsilon Honor Society for mathematics"},{"value":"Focus interest in studying entangled glass-phase saccharide amorphous microfilaments and the effects of width distribution on hygroscopicity, relaxation by creating using appropriate hardware and software."}]}},{"School":"Prime Digital Academy","City":"Bloomington","State":"MN","GradDate":"May 2016","About":{"header":"Full Stack Development Student","Body":[{"value":"Established and cemented strong development skills and principles."},{"value":"Worked with real world clients to solve real world problems and provide a solution."}]}}]}}
